Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21E17A.xml
          <instance name="SERCOM2">
            <register-group name="SERCOM2" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA08"/>
              <signal group="PAD" index="1" function="D" pad="PA09"/>
              <signal group="PAD" index="2" function="D" pad="PA10"/>
              <signal group="PAD" index="2" function="C" pad="PA14"/>
              <signal group="PAD" index="3" function="D" pad="PA11"/>
              <signal group="PAD" index="3" function="C" pad="PA15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="5"/>
              <param name="DMAC_ID_TX" value="6"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
            </parameters>
          </instance>
          <instance name="SERCOM3">
            <register-group name="SERCOM3" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA16"/>
              <signal group="PAD" index="0" function="C" pad="PA22"/>
              <signal group="PAD" index="0" function="F_RF233" pad="PA27"/>
              <signal group="PAD" index="1" function="D" pad="PA17"/>
              <signal group="PAD" index="1" function="C" pad="PA23"/>
              <signal group="PAD" index="2" function="D" pad="PA18"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="3" function="D" pad="PA19"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="7"/>
              <param name="DMAC_ID_TX" value="8"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SUPC" id="U2117" version="1.1.0">
          <instance name="SUPC">
            <register-group name="SUPC" name-in-module="SUPC" address-space="base" offset="0x40001400"/>
            <signals>
              <signal group="BGBUFREADY" index="0" function="VREG_VREF_OBS" pad="PA08"/>
              <signal group="BGBUFREADY" index="1" function="VREG_VREF_OBS" pad="PA09"/>
              <signal group="BGBUFREADY" index="2" function="VREG_VREF_OBS" pad="PA10"/>
              <signal group="BGBUFREADY" index="3" function="VREG_VREF_OBS" pad="PA11"/>
              <signal group="BIAS_TEST_OUT" function="VREG_VREF_OBS" pad="PA06"/>
              <signal group="BUCK_BIAS" function="VREG_VREF_OBS" pad="PA02"/>
              <signal group="BUCK_ILMAX" function="VREG_VREF_OBS" pad="PA22"/>
              <signal group="BUCK_IZERO" function="VREG_VREF_OBS" pad="PA23"/>
              <signal group="BUCK_READY" function="VREG_VREF_OBS" pad="PA17"/>
              <signal group="SCVREG_CURSRCON" function="VREG_VREF_OBS" pad="PA04"/>
              <signal group="SCVREG_READY" function="VREG_VREF_OBS" pad="PA19"/>
              <signal group="VREFREADY" index="1" function="VREG_VREF_OBS" pad="PA03"/>
              <signal group="VREF_ANA_OUT" function="VREG_VREF_OBS" pad="PA05"/>
            </signals>
            <parameters>
              <param name="BOD12_CALIB_MSB" value="5"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="SUPC_OUT_NUM_MSB" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="TAL" id="U2253" version="1.0.2">
          <instance name="TAL">
            <register-group name="TAL" name-in-module="TAL" address-space="base" offset="0x40002C00"/>
            <signals>
              <signal group="BRK" function="G" pad="PA27"/>
            </signals>
            <parameters>
              <param name="CPU_NUM" value="2"/>
              <param name="CTI_NUM" value="4"/>
              <param name="DMA_CH_NUM" value="16"/>
              <param name="EV_CH_NUM" value="12"/>
              <param name="EXTINT_NUM" value="16"/>
              <param name="INT_NUM" value="29"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2249" version="2.0.0">
          <instance name="TC0">
            <register-group name="TC0" name-in-module="TC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA22"/>
              <signal group="WO" index="1" function="E" pad="PA23"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="22"/>
              <param name="EXT" value="0"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
            </parameters>
          </instance>
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA24"/>
              <signal group="WO" index="1" function="E" pad="PA25"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="25"/>
              <param name="EXT" value="0"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
            </parameters>
          </instance>
          <instance name="TC4">
            <register-group name="TC4" name-in-module="TC" address-space="base" offset="0x43000800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA18"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="1" function="E" pad="PA19"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DMAC_ID_OVF" value="34"/>
              <param name="EXT" value="0"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="3.0.0">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA08"/>
              <signal group="WO" index="0" function="F_RF233" pad="PA16"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA09"/>
              <signal group="WO" index="1" function="F_RF233" pad="PA17"/>
              <signal group="WO" index="2" function="F" pad="PA10"/>
              <signal group="WO" index="2" function="F" pad="PA18"/>
              <signal group="WO" index="3" function="F" pad="PA11"/>
              <signal group="WO" index="3" function="F" pad="PA19"/>
              <signal group="WO" index="4" function="F" pad="PA22"/>
              <signal group="WO" index="4" function="F" pad="PA14"/>
              <signal group="WO" index="5" function="F" pad="PA15"/>
              <signal group="WO" index="5" function="F" pad="PA23"/>
              <signal group="WO" index="6" function="F" pad="PA16"/>
              <signal group="WO" index="7" function="F" pad="PA17"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="11"/>
              <param name="DTI" value="1"/>
              <param name="EXT" value="31"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="8"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1"/>
              <param name="TYPE" value="1"/>
            </parameters>
          </instance>
          <instance name="TCC1">
            <register-group name="TCC1" name-in-module="TCC" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA06"/>
              <signal group="WO" index="0" function="E" pad="PA10"/>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA07"/>
              <signal group="WO" index="1" function="E" pad="PA11"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
              <signal group="WO" index="2" function="F" pad="PA08"/>
              <signal group="WO" index="2" function="F" pad="PA24"/>
              <signal group="WO" index="3" function="F" pad="PA09"/>
              <signal group="WO" index="3" function="F" pad="PA25"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="16"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="24"/>
              <param name="OTMX" value="0"/>
              <param name="OW_NUM" value="4"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="0"/>
              <param name="TYPE" value="2"/>
            </parameters>
          </instance>
